<?php

use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        App\Category::create(['name' => 'การ์ตูน']);
        App\Category::create(['name' => 'วรรณกรรม นวนิยาย']);
        App\Category::create(['name' => 'นิตยสาร']);
        App\Category::create(['name' => 'หนังสือต่างประเทศ']);

        App\Promotion::create([
          'id' => '1421',
          'title' => 'เช่า5เล่มลด10%',
          'description' => 'เช่าหนังสือของร้านทุกประเภทตั้งแต่5เล่มขึ้นไปได้รับส่วนลดทันที15%',
          'expired_date' => '20 พ.ค. 2560'
        ]);
        App\Promotion::create([
          'id' => '1422',
          'title' => 'เช่านวนิยาย ลดราคา 15%',
          'description' => 'เช่าหนังสือประเภทนวนิยายได้รับส่วนลดทันที5%',
          'expired_date' => '25 มิ.ย. 2560'
        ]);
        App\Promotion::create([
          'id' => '1423',
          'title' => 'เช่าหนังสือ10เล่มขึ้นไปได้สิทธิ์เช่าฟรีอีก1เล่ม',
          'description' => 'เช่าหนังสือของทางร้านทุกประเภทตั้งแต่10เล่มขึ้นไปในการเช่า1ครั้งได้สิทธิ์เช่าฟรีทันทีอีก1เล่ม',
          'expired_date' => '17 พ.ย. 2560'
        ]);




        $category = App\Category::where('name', '=', 'วรรณกรรม นวนิยาย')->first();
        if (!is_null($category)) {
            $category->books()->saveMany([
                            new App\Book([
                    'name' => "รักเปื้อนร้าย",
                    'status' => "available",
                    'price' => 50.00,
                    'author' =>"-",
                    'year' =>'25 เม.ย. 2560',
                    'pageSize' =>"90 หน้า",
                    'publishComp' =>'เข็มเขียน',
                    'description' =>"หนังสือนี้เหมาะกับผู้ที่เคยอ่านหรือมีความรู้พื้นฐานสำหรับเรื่อง สามก๊ก อยู่แล้ว  เพราะผู้เขียนได้เขียนเรื่องนี้แบบตัดมาเป็นตอนๆ  ไม่ได้บอกถึงภูมิหลังหรือเรื่องครั้งก่อนที่โยงมาถึงตอนที่ตัดมา  ผู้ที่ไม่เคยอ่าน สามก๊ก ฉบับเต็มหรือฉบับย่อที่ค่อนข้างละเอียดมาก่อน  อาจไม่เข้าใจ   เพราะไม่เห็นความต่อเนื่องของเรื่อง  แต่เชื่อว่าผู้ที่ซื้อหนังสือนี้อ่าน  น่าจะเป็นผู้ที่เคยอ่านหรือมีความรู้พื้นฐานสำหรับเรื่อง สามก๊ก อยู่แล้ว",
                    'img' =>'1.jpg'
                ]),

                            new App\Book([
                    'name' => "เจาะจิตฆาตกร เล่ม 1 ตอน ผ่าปมวิปริต",
                    'status' => "available",
                    'price' => 295.00,
                    'author' =>"-",
                    'year' =>'16 ก.พ. 2560',
                    'pageSize' =>"426 หน้า",
                    'publishComp' =>'นานมีบุ๊คส์ จำกัด',
                    'description' =>"เรื่องความรักที่ไม่ลงตัว  ถ้าเธอรู้ว่าเขาคือเขา  จบแน่นอน.
เขาจึงต้องไม่ใช่เขา  จะปลอมตัวเป็นใครดี  คิดไปคิดมา  ปลอมเป็นตัวเองดีกว่า
แล้วไปหลอกเธอว่าเขาคือเขา  เอ๊ะ ยังไง  แล้วจะรอดไหม?.",
                    'img' =>'2.jpg'
                ]),

                            new App\Book([
                    'name' => "นิยายสั้นสุดมันส์ เรื่องสั้นอันตราย",
                    'status' => "available",
                    'price' => 50.00,
                    'author' =>"ล. วิลิศมาหรา",
                    'year' =>'6 ก.ค. 2558',
                    'pageSize' =>"75 หน้า",
                    'publishComp' =>'ล. วิลิศมาหรา',
                    'description' =>'ขอยินดีต้อนรับสู่ Ghost City เมืองเขย่าขวัญ เกมเรียลลิตี้สุดเขย่าประสาทชวนขนหัวลุก ซึ่งได้ GC ทั้ง 6 หมายเลข ได้แก่ ต้าร์ เฟรม พาร์ท แนนนี่ อะตอม และเฟริน ทั้ง 6 คน ได้ผ่านการพิจารณาแล้วว่ามีความเหมาะสมให้เข้าร่วมเล่นเกมมากที่สุด กฎของเกมมีเพียง 2 ข้อ โปรดจำให้ขึ้นใจ ข้อที่ 1 หากคิดจะเล่นต่อ ต้องพร้อมเผชิญหน้ากับความหลอนสุดระทึก เพื่อเป็นผู้คว้าชัยชนะแห่งเกมเมืองเขย่าขวัญ และข้อที่ 2 หากไม่ไหว อย่าฝืน จงถอนตัวออกจากเกมเสีย ก่อนที่ทุกอย่างจะสายเกินไป!',
                    'img' =>'3.png'
                ]),
                            new App\Book([
                    'name' => "แดนรักมาเฟียเถื่อน",
                    'status' => "available",
                    'price' => 279.00,
                    'author' =>"-",
                    'year' =>'5 พ.ค. 2560',
                    'pageSize' =>"364 หน้า",
                    'publishComp' =>'วรัมพร',
                    'description' =>'“คำพูด” คือ เสียงที่เปล่งออกมาง่ายๆ แต่มีผลกระทบต่อชีวิตทั้งชีวิตไม่ว่าจะ “สุข” หรือ “ทุกข์” “สำเร็จ” หรือ “ล้มเหลว” กำหนดได้ด้วย “คำพูด” ที่ออกมาจากจิตใจเราทั้งนั้น การที่จะพูดให้คนชื่นชอบเรานั้นไม่ใช่เรื่องยาก แต่จะทำอย่างไรให้เชื่อถือเรานั้นยากยิ่งกว่า และการพูดแบบไหนที่คนทั่วๆ ไปไม่ชอบ เชิญท่านพบคำตอบได้ในหนังสือ “พูดชนะใจ” ได้เลย ',
                    'img' =>'4.jpg'
                ]),
                            new App\Book([
                    'name' => "พระพรหมแสนซน",
                    'status' => "available",
                    'price' => 250.00,
                    'author' =>"-",
                    'year' =>'24 ม.ค. 2560',
                    'pageSize' =>"603 หน้า",
                    'publishComp' =>'รัชนีกานต์',
                    'description' => "ข้อมูลเตรียมตัวก่อนเดินทางเต็มฉบับครบสมบูรณ์แบบ เที่ยว กิน ชอป ครบอรรถรส บุกสถานที่ถ่ายทำตามรอยซีรี่ย์เกาหลีชื่อดัง หนังสือที่คนไปเที่ยวเกาหลี ต้องพกติดตัว",
                    'img' =>'5.png'
                ]),
                            new App\Book([
                    'name' => "นิยายสั้นสุดมันส์ เรื่องสั้นอันตราย2",
                    'status' => "available",
                    'price' => 50.00,
                    'author' =>"ล. วิลิศมาหรา",
                    'year' =>'6 ก.ค. 2558',
                    'pageSize' =>"50 หน้า",
                    'publishComp' =>'ล. วิลิศมาหรา',
                    'description' => "ผลงานเล่มล่าสุดจากผู้เขียน สิรภพ มหรรฆสุวรรณ เจ้าของผลงานหนังสือขายดี ชุด แบกเป้ ตะลุยเดี่ยว ลัดเลี้ยวเที่ยว",
                    'img' =>'6.png'
                ]),
                            new App\Book([
                    'name' => "เรื่องของฟ้าวลี สาวน้อยบนตึก",
                    'status' => "available",
                    'price' => 50.00,
                    'author' =>"-",
                    'year' =>'16 ม.ค. 2560',
                    'pageSize' =>"169 หน้า",
                    'publishComp' =>'บ้านวารสาร',
                    'description' => "ในโลกแห่งการทำงาน หลายครั้งมื่อเราวิเคราะห์สภาพปัญหา พบว่า ปัญหาส่วนใหญ่มิได้เกิดจาก “ตัวเนื้องาน” ที่แต่ละคนรับผิดชอบ แต่ปัญหาจำนวนมากกลับเกิดจาก “ตัวบุคคคล” หนังสือ เทคนิคการวางตัวในที่ทำงานเล่มนี้ เป็นคำตอบของคนทำงานทุกคน เพื่อการวางตัวอย่างไรให้เข้าตานายและถูกใจเพื่อน หัวหน้างานและเพื่อนร่วมงานที่เราเลือกไม่ได้ เพื่อให้เรามีความสุขและประสบความสำเร็จในงานที่ทำ",
                    'img' =>'7.jpg'
                ]),
                            new App\Book([
                    'name' => "บัญชารักเทพบุตรเถื่อน",
                    'status' => "available",
                    'price' => 289.00,
                    'author' =>"-",
                    'year' =>'5 พ.ค. 2560',
                    'pageSize' =>"447 หน้า",
                    'publishComp' =>'วรัมพร',
                    'description' => "หนังสือนี้เหมาะกับผู้ที่เคยอ่านหรือมีความรู้พื้นฐานสำหรับเรื่อง สามก๊ก อยู่แล้ว  เพราะผู้เขียนได้เขียนเรื่องนี้แบบตัดมาเป็นตอนๆ  ไม่ได้บอกถึงภูมิหลังหรือเรื่องครั้งก่อนที่โยงมาถึงตอนที่ตัดมา  ผู้ที่ไม่เคยอ่าน สามก๊ก ฉบับเต็มหรือฉบับย่อที่ค่อนข้างละเอียดมาก่อน  อาจไม่เข้าใจ   เพราะไม่เห็นความต่อเนื่องของเรื่อง  แต่เชื่อว่าผู้ที่ซื้อหนังสือนี้อ่าน  น่าจะเป็นผู้ที่เคยอ่านหรือมีความรู้พื้นฐานสำหรับเรื่อง สามก๊ก อยู่แล้ว",
                    'img' =>'8.jpg'
                ]),
                            new App\Book([
                    'name' => "สงครามลิขิตรัก",
                    'status' => "available",
                    'price' => 350.00,
                    'author' =>"ธุวดารา",
                    'year' =>'4 พ.ค. 2560',
                    'pageSize' =>"468 หน้า",
                    'publishComp' =>'ลัลล์ลลิล',
                    'description' => '"หนังสือชุด ณ ที่นี่มีตำนาน นำเรื่องราว 
นิทาน ตำนาน และวรรณกรรม ที่มีเนื้อหา
เกี่ยวพันกับสถานที่ต่างๆ มาสู่สายตาผู้อ่าน 
เพื่อความบันเทิงที่ผสมผสานด้วยสาระบ้าง 
เล็กๆ น้อยๆ โดยเฉพาะอย่างยิ่งเมื่อมี
โอกาสได้เยือนถึงถิ่นแห่งตำนานจริง จะได้
รับทั้งอาหารตาและอาหารใจไปพร้อมๆ กัน 
ไม่ว่า พระนางจามเทวี นางยม พญากง-
พญาพาน ท้าวแสนปม หรือแม่นาคพระ
โขนง ฯลฯ เราต่างเคยได้ยินเรื่องราวมา
บ้างที่เล่ากันแต่วัยเยาว์ ได้รับเกร็ดความรู้
เชิงตำนานและประวัติศาสตร์"',
                    'img' =>'9.jpg'
                ]),
                            new App\Book([
                    'name' => "ซีรี่ย์รักชุด อสูรปองรัก",
                    'status' => "available",
                    'price' => 99.00,
                    'author' =>"คีตะธารา",
                    'year' =>'2 พ.ค. 2560',
                    'pageSize' =>"189 หน้า",
                    'publishComp' =>'-',
                    'description' =>'"หนังสือชุด ณ ที่นี่มีตำนาน นำเรื่องราว 
นิทาน ตำนาน และวรรณกรรม ที่มีเนื้อหา
เกี่ยวพันกับสถานที่ต่างๆ มาสู่สายตาผู้อ่าน 
เพื่อความบันเทิงที่ผสมผสานด้วยสาระบ้าง 
เล็กๆ น้อยๆ โดยเฉพาะอย่างยิ่งเมื่อมี
โอกาสได้เยือนถึงถิ่นแห่งตำนานจริง จะได้
รับทั้งอาหารตาและอาหารใจไปพร้อมๆ กัน 
ไม่ว่า พระนางจามเทวี นางยม พญากง-
พญาพาน ท้าวแสนปม หรือแม่นาคพระ
โขนง ฯลฯ เราต่างเคยได้ยินเรื่องราวมา
บ้างที่เล่ากันแต่วัยเยาว์ ได้รับเกร็ดความรู้
เชิงตำนานและประวัติศาสตร์"
',
                    'img' =>'10.jpg'
                ]),
                            new App\Book([
                    'name' => "ภูผาไอยรา",
                    'status' => "available",
                    'price' => 150.00,
                    'author' =>"ธุวดารา",
                    'year' =>'1 พ.ค. 2560',
                    'pageSize' =>"225 หน้า",
                    'publishComp' =>'ลัลล์ลลิล',
                    'description' =>'"เรื่องราวความรักสุดมหัศจรรย์ของหญิงสาวชาวโลกธรรมดากับเจ้าชายหนุ่มต่างดาวที่จะทำให้ทุกคนประทับใจไม่รู้ลืม
ร่วมสัมผัสกับความเร้นลับของจักรวาลไปกับ ลินิน ที่ชะตาชีวิตเล่นตลกให้เธอมีพลังลึกลับตั้งแต่ยังแบเบาะ ซึ่งแท้จริงนั้นเป็นพลังจาก “ผลึกแห่งเออร์” ที่เจ้าแห่งดวงดาวทั้งหลายในจักรวาลต่างก็แย่งชิงเพื่อความเป็นอภิมหาอำนาจแห่งห้วงจักรวาล...
ท่ามกลางสงครามที่ร้อนระอุ ความรักและความผูกพันกับก่อเกิดขึ้นในหัวใจของคนทั้งสอง... ลินิน และ เจ้าชายต่างดาวผู้ทรงอำนาจ... เขาคือคนที่คอยปกป้องเธอให้รอดพ้นจากการไล่ล่าของผู้ที่ต้องการครอบครองผลึกแห่งเออร์... 
"',
                    'img' =>'11.jpg'
                ]),
                            new App\Book([
                    'name' => "กลลวงจอมพยัคฆ์",
                    'status' => "available",
                    'price' => 249.00,
                    'author' =>"นรีรัตน์",
                    'year' =>'6 เม.ย. 2560',
                    'pageSize' =>"457 หน้า",
                    'publishComp' =>'-',
                    'description' => 'เพราะคำว่า "รัก" เพียงคำเดียว ทำให้ ฟารุค หนุ่มผู้มีพลังอสูรแฝงอยู่ในตัวตั้งแต่กำเนิด จึงตัดสินใจตาม อันธิกา หญิงสาวผู้เป็นที่รักมายังโลกมนุษย์ แต่กลับถูกแม่ของเธอกีดกัน เพราะเขาเป็นเพียงสตันต์แมนผู้ต่ำต้อย และเพื่อเป็นการเรียกคะแนนจากว่าที่แม่ยาย ชายหนุ่มจึงตัดสินใจกลับไปถิ่นเดิมเพื่อหาสมบัติ แต่นั่นเท่ากับเป็นการนำพามาซึ่งความยุ่งยากต่างๆ
ฟารุคจะรับมือกับสิ่งที่เกิดขึ้นอย่างไร จะอยู่ได้หรือไม่ในโลกมนุษย์ที่แปลกประหลาดสำหรับเขา ท้ายที่สุดชายหนุ่มจะฝ่าด่านอรหันต์อย่างแม่ของอันธิกาไปได้หรือไม่ โปรดติดตาม...',
                    'img' =>'12.jpg'
                ]),
                            new App\Book([
                    'name' => "เนเมียวสีหบดี",
                    'status' => "available",
                    'price' => 93.00,
                    'author' =>"กุดารัศมี",
                    'year' =>'25 เม.ย. 2560',
                    'pageSize' =>"189 หน้า",
                    'publishComp' =>'กุดารัศมี',
                    'description' => 'บินไปยังเนฟเวอร์แลนด์กับปีเตอร์ เวนดี้ จอห์น ไมเคิล และทิงเกอร์ เบลล์!',
                    'img' =>'13.jpg'
                ]),

            ]);

        }


 
        $category = App\Category::where('name', '=', 'นิตยสาร')->first();
        if (!is_null($category)) {
            $category->books()->saveMany([
                            new App\Book([
                    'name' => "เคหการเกษตร ฉบับ พฤษภาคม 2560",
                    'status' => "available",
                    'price' => 70.00,
                    'author' =>"-",
                    'year' =>'27 เม.ย. 2560',
                    'pageSize' =>"143 หน้า",
                    'publishComp' =>'เคหะการเกษตร',
                    'description' =>'นิตยสารเที่ยวรอบโลก ในเครือสำนักพิมพ์อทิตตา เป็นนิตยสารท่องเที่ยวรายเดือนภาษาไทย ซึ่งก่อตั้งมาตั้งแต่ปี 2525 และกำลังก้าวเข้าสู่ปีที่ 35 ในปีนี้ โดยเนื้อหาในเล่มประกอบด้วยบทความท่องเที่ยวทั้งต่างประเทศ และในประเทศ ในแต่ละเล่มมีเรื่องเด่นประจำฉบับ พร้อมเรื่องราวอื่น ๆ ที่จะพาผู้อ่านเดินทางท่องเที่ยวไปในประเทศต่าง ๆ ทั่วโลก ด้วยสำนวนภาษาที่อ่านเข้าใจง่ายและภาพถ่ายที่สวยงาม กระตุ้นให้ผู้อ่านจินตนาการเสมือนได้ร่วมเดินทางไปพร้อมกับผู้เขียน นอกจากบทความท่องเที่ยวแล้ว ยังมีคอลัมน์สัมภาษณ์บุคคลในแวดวงสายการบิน สถานทูต สำนักงานท่องเที่ยว โรงแรม บริษัททัวร์ และอื่น ๆ',
                    'img' =>'14.jpg'
                ]),

                            new App\Book([
                    'name' => "นิตยสาร IMpossible no.2",
                    'status' => "available",
                    'price' => 95.00,
                    'author' =>"-",
                    'year' =>'27 ก.พ. 2560',
                    'pageSize' =>"45 หน้า",
                    'publishComp' =>'อิม',
                    'description' =>'นิตยสารเที่ยวรอบโลก ในเครือสำนักพิมพ์อทิตตา เป็นนิตยสารท่องเที่ยวรายเดือนภาษาไทย ซึ่งก่อตั้งมาตั้งแต่ปี 2525 และกำลังก้าวเข้าสู่ปีที่ 35 ในปีนี้ โดยเนื้อหาในเล่มประกอบด้วยบทความท่องเที่ยวทั้งต่างประเทศ และในประเทศ ในแต่ละเล่มมีเรื่องเด่นประจำฉบับ พร้อมเรื่องราวอื่น ๆ ที่จะพาผู้อ่านเดินทางท่องเที่ยวไปในประเทศต่าง ๆ ทั่วโลก ด้วยสำนวนภาษาที่อ่านเข้าใจง่ายและภาพถ่ายที่สวยงาม กระตุ้นให้ผู้อ่านจินตนาการเสมือนได้ร่วมเดินทางไปพร้อมกับผู้เขียน นอกจากบทความท่องเที่ยวแล้ว ยังมีคอลัมน์สัมภาษณ์บุคคลในแวดวงสายการบิน สถานทูต สำนักงานท่องเที่ยว โรงแรม บริษัททัวร์ และอื่น ๆ',
                    'img' =>'15.jpg'
                ]),

                            new App\Book([
                    'name' => "Mellow ISSUE 13",
                    'status' => "available",
                    'price' => 50.00,
                    'author' =>"-",
                    'year' =>'5 ก.ค. 2559',
                    'pageSize' =>"44 หน้า",
                    'publishComp' =>'เมลโล่',
                    'description' =>'นิตยสารเที่ยวรอบโลก ในเครือสำนักพิมพ์อทิตตา เป็นนิตยสารท่องเที่ยวรายเดือนภาษาไทย ซึ่งก่อตั้งมาตั้งแต่ปี 2525 และกำลังก้าวเข้าสู่ปีที่ 35 ในปีนี้ โดยเนื้อหาในเล่มประกอบด้วยบทความท่องเที่ยวทั้งต่างประเทศ และในประเทศ ในแต่ละเล่มมีเรื่องเด่นประจำฉบับ พร้อมเรื่องราวอื่น ๆ ที่จะพาผู้อ่านเดินทางท่องเที่ยวไปในประเทศต่าง ๆ ทั่วโลก ด้วยสำนวนภาษาที่อ่านเข้าใจง่ายและภาพถ่ายที่สวยงาม กระตุ้นให้ผู้อ่านจินตนาการเสมือนได้ร่วมเดินทางไปพร้อมกับผู้เขียน นอกจากบทความท่องเที่ยวแล้ว ยังมีคอลัมน์สัมภาษณ์บุคคลในแวดวงสายการบิน สถานทูต สำนักงานท่องเที่ยว โรงแรม บริษัททัวร์ และอื่น ๆ',
                    'img' =>'16.jpg'
                ]),
                            new App\Book([
                    'name' => "หมอชาวบ้าน พฤษภาคม 2560 Vol.457",
                    'status' => "available",
                    'price' => 55.00,
                    'author' =>"-",
                    'year' =>'28 เม.ย. 2560',
                    'pageSize' =>"95 หน้า",
                    'publishComp' =>'สำนักพิมพ์หมอชาวบ้าน',
                    'description' =>'นิตยสารเที่ยวรอบโลก ในเครือสำนักพิมพ์อทิตตา เป็นนิตยสารท่องเที่ยวรายเดือนภาษาไทย ซึ่งก่อตั้งมาตั้งแต่ปี 2525 และกำลังก้าวเข้าสู่ปีที่ 35 ในปีนี้ โดยเนื้อหาในเล่มประกอบด้วยบทความท่องเที่ยวทั้งต่างประเทศ และในประเทศ ในแต่ละเล่มมีเรื่องเด่นประจำฉบับ พร้อมเรื่องราวอื่น ๆ ที่จะพาผู้อ่านเดินทางท่องเที่ยวไปในประเทศต่าง ๆ ทั่วโลก ด้วยสำนวนภาษาที่อ่านเข้าใจง่ายและภาพถ่ายที่สวยงาม กระตุ้นให้ผู้อ่านจินตนาการเสมือนได้ร่วมเดินทางไปพร้อมกับผู้เขียน นอกจากบทความท่องเที่ยวแล้ว ยังมีคอลัมน์สัมภาษณ์บุคคลในแวดวงสายการบิน สถานทูต สำนักงานท่องเที่ยว โรงแรม บริษัททัวร์ และอื่น ๆ',
                    'img' =>'17.jpg'
                ]),
                            new App\Book([
                    'name' => "SciMag ฉบับสิงหาคม 2559",
                    'status' => "available",
                    'price' => 80.00,
                    'author' =>"-",
                    'year' =>'4 ส.ค. 2559',
                    'pageSize' =>"42 หน้า",
                    'publishComp' =>'ซายแมก',
                    'description' => 'นิตยสารเที่ยวรอบโลก ในเครือสำนักพิมพ์อทิตตา เป็นนิตยสารท่องเที่ยวรายเดือนภาษาไทย ซึ่งก่อตั้งมาตั้งแต่ปี 2525 และกำลังก้าวเข้าสู่ปีที่ 35 ในปีนี้ โดยเนื้อหาในเล่มประกอบด้วยบทความท่องเที่ยวทั้งต่างประเทศ และในประเทศ ในแต่ละเล่มมีเรื่องเด่นประจำฉบับ พร้อมเรื่องราวอื่น ๆ ที่จะพาผู้อ่านเดินทางท่องเที่ยวไปในประเทศต่าง ๆ ทั่วโลก ด้วยสำนวนภาษาที่อ่านเข้าใจง่ายและภาพถ่ายที่สวยงาม กระตุ้นให้ผู้อ่านจินตนาการเสมือนได้ร่วมเดินทางไปพร้อมกับผู้เขียน นอกจากบทความท่องเที่ยวแล้ว ยังมีคอลัมน์สัมภาษณ์บุคคลในแวดวงสายการบิน สถานทูต สำนักงานท่องเที่ยว โรงแรม บริษัททัวร์ และอื่น ๆ',
                    'img' =>'18.jpg'

            ]),
        ]);

        }

        $category = App\Category::where('name', '=', 'การ์ตูน')->first();
        if (!is_null($category)) {
            $category->books()->saveMany([
                            new App\Book([
                    'name' => "ก้าวแรกสู่สังเวียน เล่ม 74",
                    'status' => "available",
                    'price' => 59.00,
                    'author' =>" โจจิ โมริคาว่า",
                    'year' =>'25 เม.ย. 2560',
                    'pageSize' =>"90 หน้า",
                    'publishComp' =>'Kodansha Ltd.',
                    'description' => 'นิตยสารรายเดือนชั้นนำที่มียอดจำหน่ายสูงสุดของประเทศฝรั่งเศส ญี่ปุ่น และอีก 8 ประเทศในยุโรปและเอเชีย ในเครือของหนังสือพิมพ์ Le Figaro ซึ่งเป็นหนังสือพิมพ์ที่อยู่คู่กับประเทศฝรั่งเศสมาแล้วถึง 184 ปี ในส่วนของ Madame Figaro ฝรั่งเศส ก็เพิ่งฉลองครบรอบ 30 ปี ในปี 2010',
                    'img' =>'19.jpg'
                ]),

                            new App\Book([
                    'name' => "มังกรอหังการ ภาค สงครามจงหยวน เล่ม 15",
                    'status' => "available",
                    'price' => 59.00,
                    'author' =>" YOSHITO YAMAHARA",
                    'year' =>'12 ส.ค. 2560',
                    'pageSize' =>"-",
                    'publishComp' =>'Kodansha Ltd.',
                    'description' =>'หนังสือนิทานเรื่องนี้นำเรื่องราวของพูห์ฉบับภาพยนตร์กลับมาสร้างใหม่ เป็นเรื่องราวของพูห์และผองเพื่อนซึ่งออกตามหาหางเหมาะๆ ให้กับอียอร์ เพราะหางของอียอร์หายไป แล้วทั้งหมดยังต้องช่วยคริสโตเฟอร์ โรบินจากสัตว์ลึกลับที่ชื่อว่าเดี่ยวม้าอีกต้วย ทั้งหมดนี้เกิดขึ้นในหนึ่งวันอันแสนสนุก!',
                    'img' =>'20.jpg'
                ]),

                            new App\Book([
                    'name' => "ยอดยุทธ์บุรุษเหล็ก เล่ม 54",
                    'status' => "available",
                    'price' => 50.00,
                    'author' =>"ซิวฝูหลง",
                    'year' =>'5 ก.ค. 2558',
                    'pageSize' =>"-",
                    'publishComp' =>' Dark Comic & Toys Limited',
                    'description' =>'ด็อกชอบเล่นตีฟองสบู่กับเอมมี่และอัลม่า เพื่อนของเธอ แต่เมื่อถึงตอนที่น้ำสบู่ของบั๊บเบิ้ลมังกี้หมด ก็ไม่มีฟองสบู่ให้ตี อัลม่าเติมน้ำสบู่จนเต็มอีกครั้ง แต่มีบางสิ่งผิดปกติ บั๊บเบิ้ลมังกี้ไม่เป่าฟองสบู่ออกมา ถึงเวลาต้องตรวจร่างกายของบั๊บเบิ้ลมังกี้แล้วละ!',
                    'img' =>'21.jpg'
                ]),
                            new App\Book([
                    'name' => "
ไฮคิว! Haikyu คู่ตบฟ้าประทาน ฮินาตะกับคาเงยามะ หนังสือ การ์ตูน ญี่ปุ่น Haikyu smm sic สยามอินเตอร์",
                    'status' => "available",
                    'price' => 713.00,
                    'author' =>"ทีมงานอี.คิว.พลัส จีเนียส",
                    'year' =>'24 พ.ค. 2560',
                    'pageSize' =>"181 หน้า",
                    'publishComp' =>' E.Q.Plus Genius',
                    'description' =>'หนังสือนิทานเรื่องนี้นำเรื่องราวของพูห์ฉบับภาพยนตร์กลับมาสร้างใหม่ เป็นเรื่องราวของพูห์และผองเพื่อนซึ่งออกตามหาหางเหมาะๆ ให้กับอียอร์ เพราะหางของอียอร์หายไป แล้วทั้งหมดยังต้องช่วยคริสโตเฟอร์ โรบินจากสัตว์ลึกลับที่ชื่อว่าเดี่ยวม้าอีกต้วย ทั้งหมดนี้เกิดขึ้นในหนึ่งวันอันแสนสนุก!',
                    'img' =>'22.jpg'
                ]),
                            new App\Book([
                    'name' => "SMM หนังสือการ์ตูน เซียวซิวจุ้ย ยอดยุทธ์ผู้พิชิต เล่ม 1 - 10(จบ)",
                    'status' => "available",
                    'price' => 902.00,
                    'author' =>"-",
                    'year' =>'24 ม.ค. 2560',
                    'pageSize' =>"603 หน้า",
                    'publishComp' =>'Siam inter multimedia co.,ltd.-C200042',
                    'description' =>'ซินเดอเรลล่าทำให้เด็กหญิงตัวน้อยที่โรงเรียนรู้ว่า การเป็นเจ้าหญิงมีอะไรมากกว่าแค่ไปงานเลี้ยงและสวมชุดสวยๆ มาร่วมติดตามดูซินเดอเรลล่าสอนให้หนูน้อยเข้าใจว่า จริงๆ แล้วการเป็นเจ้าหญิงหมายความอย่างไร',
                    'img' =>'23.png'
                ]),
                            new App\Book([
                    'name' => " หนังสือการ์ตูน My Hero Academia เล่ม 1 - 7",
                    'status' => "available",
                    'price' => 333.00,
                    'author' =>"-",
                    'year' =>'6 ก.ค. 2558',
                    'pageSize' =>"50 หน้า",
                    'publishComp' =>'สยามอินเตอร์มัลติมีเดีย จำกัด (มหาชน)',
                    'description' =>'โลกทั้งใบต้องกลายมาเป็นสนามแข่ง เมื่อซูเปอร์สตาร์ ไลท์นิ่ง แม็คควีนกลับมาแสดงฝีมือ พร้อมคู่หูของเขา เจ้ารถลากจูงเมเทอร์ เพื่อรักษาตำแหน่งรถที่เร็วและแรงที่สุดในโลก ใน Cars 2 (ภาค 2 ของสี่ล้อซิ่ง...ซ่าท้าโลก) จากดิสนีย์-พิกซาร์',
                    'img' =>'24.png'
                ]),
                            new App\Book([
                    'name' => "KOBATO. โคบาโตะ 6 (เล่มจบ)",
                    'status' => "available",
                    'price' => 55.00,
                    'author' =>"CLAMP",
                    'year' =>'1 เม.ย. 2559',
                    'pageSize' =>"181 หน้า",
                    'publishComp' =>'บงกช คอมมิคส์',
                    'description' =>'ฤดูกาลมักมาคู่กับความรัก เปรียบดั่งจั๊กจั่นมักส่งเสียงร้องให้ได้ยินกันหนาหูในช่วงปลายเดือน 7 นั่นเป็นเพราะฤดูร้อนเป็นฤดูแห่งการหาคู่ของพวกมัน.....เรื่องราวความรักเกิดขึ้น เมื่อนาริต้องมาใช้ชีวิต
อยู่ร่วมใต้ชายคาเดียวกับ เคียวเฮ เพื่อนในวัยเด็กที่ย้ายบ้านมาอยู่ที่ต่างจังหวัด และอะไรจะเกิดขึ้น
ท่ามกลางสายลมร้อนที่พัดผ่าน ความรักในฤดูร้อนของสองเราจึงได้ก่อตัวขึ้น....',
                    'img' =>'25.jpg'
                ]),
 

            ]);

        }

        $category = App\Category::where('name', '=', 'หนังสือต่างประเทศ')->first();
        if (!is_null($category)) {
            $category->books()->saveMany([
                            new App\Book([
                    'name' => "culture and etiquette book",
                    'status' => "available",
                    'price' => 450.00,
                    'author' =>"-",
                    'year' =>'20 ก.ค. 2559',
                    'pageSize' =>"540 หน้า",
                    'publishComp' =>'-',
                    'description' =>'For two weeks, Pixie Hollow has been in a terrible dry spell. Everyone is frazzled, especially Rani and the other the water-talent fairies. When the dry spell finally ends, Queen Clarion decides its time for a treat—a fairy treasure hunt! But on the day of the treasure hunt, Rani wakes up late. Her friends all have partners already, so Rani is stuck with the slowest-moving sparrow man around. To make things worse, she has a bet with Vidia. If Vidia finishes before her, Rani will have to do whatever the fast-flying fairy wants. This is one contest Rani cant let herself lose!',
                    'img' =>'26.jpg'
                ]),

                            new App\Book([
                    'name' => "outsider art",
                    'status' => "available",
                    'price' => 200.00,
                    'author' =>"-",
                    'year' =>'14 ธ.ค. 2554',
                    'pageSize' =>"46 หน้า",
                    'publishComp' =>'ภาพวาดกีฬาปีนผา',
                    'description' =>'for those who prefer to understand their tradition and lifestyle of the Akha Hilltribe',
                    'img' =>'27.jpg'
                ]),

                            new App\Book([
                    'name' => "GREAT LEADERS, GREAT SPEECHES",
                    'status' => "available",
                    'price' => 300.00,
                    'author' =>"ดร.ธีรวิทย์ ภิญโญณัฐกานต์",
                    'year' =>'17 เม.ย. 2555',
                    'pageSize' =>"184 หน้า",
                    'publishComp' =>' Dark Comic & Toys Limited',
                    'description' => 'Freedom of thought (also called the freedom of conscience or ideas) is the freedom of an individual to hold or consider a fact, viewpoint, or thought, independent of others viewpoints',
                    'img' =>'28.jpg'
                ]),
                            new App\Book([
                    'name' => "A History of Freedom of Thought",
                    'status' => "available",
                    'price' => 600.00,
                    'author' =>"J. B. BURY",
                    'year' =>'17 ม.ค. 2555',
                    'pageSize' =>"181 หน้า",
                    'publishComp' =>'kanomdesign Studio',
                    'description' =>'Daregear A man in a black armour fighting against terrorists for the sake of people in the 3 southernmost provinces of Thailand. (All Character is only imagine)',
                    'img' =>'29.png'
                ]),
                            new App\Book([
                    'name' => "5 Simple Tips to Boost Your Sales in the Jewelry Business",
                    'status' => "available",
                    'price' => 119.00,
                    'author' =>"-",
                    'year' =>'16 ต.ค. 2555',
                    'pageSize' =>"64 หน้า",
                    'publishComp' =>'อินฟินิตี้แอนด์บียอนด์',
                    'description' => 'TYPOGRAPHIC TECHNICAL SERIES FOR APPRENTICES',
                    'img' =>'30.jpg'
                ]),
 

            ]);

        }

    }
}
